Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/working_abroad/voluntary_development_work_abroad_and_social_insurance.html.txt.tmx
Source language: en
Languages: ga

source: Voluntary development work abroad and social insurance
ga: Obair dheonach forbartha thar lear agus árachas sóisialta

source: If you are living in Ireland and have spent time working in a developing country, you may qualify for credited social insurance contributions for the period you spent working abroad and any preparatory period beforehand
ga: Má tá tú i do chónaí in Éirinn agus tá am caite agat ag obair i dtír atá ag forbairt, d'fhéadfadh sé go mbeadh tú in ann ranníocaíochtaí creidiúnaithe árachais shóisialaigh a fháil maidir leis an tréimhse a chaith tú ag obair thar lear chomh maith le haon tréimhse ullmhúcháin roimh ré

source: Under the Volunteer Development Worker (VDW) scheme these credited social insurance contributions are called VDW credits and have been in place since 6 April 1983
ga: Faoin Scéim na nOibrithe Forbartha Deonacha (OFD) tugtar creidmheasanna OFD ar na ranníocaíochtaí árachais shóisialaigh chreidiúnaithe seo agus tá siad i bhfeidhm in Éirinn ón 6 Aibreán 1983

source: Social insurance contributions entitle you to a range of benefits that are administered by the Department of Social Protection
ga: Tugann ranníocaíochtaí árachais shóisialaigh deis duit leas a bhaint as réimhse sochar atá dhá riaradh ag an Roinn Coimirce Sóisialaí

source: VDW credits are normally fully reckonable, that is, they are treated as paid social insurance contributions
ga: Is creidmheasanna iomlán inríofa iad creidmheasanna OFD go hiondúil, is é sin le rá go mbreathnaítear orthu mar ranníocaíochtaí íoctha

source: Therefore, on your return to this country, VDW credits can help you to qualify for certain social welfare benefits and pensions
ga: Mar sin, nuair a thagann tú ar ais chuig an tír seo is féidir le creidmheasanna OFD a bheith ina gcúnamh duit sochair agus pinsin faoi leith leasa shóisialaigh a fháil

source: Also certain qualifying conditions for entitlement to Maternity Benefit, Health and Safety Benefit, Jobseeker's Benefit, Illness Benefit and Treatment Benefit have been relaxed for returned volunteer development workers (VDWs)
ga: Tá sé tábhachtach go mbeadh a fhios agat go bhfuil roinnt de na coinníollacha cáilíochta don Sochar Máithreachais, Sochar Sláinte agus Sábháilteachta, Sochar Cuardaitheora Poist, Sochar Breoiteachta agus Sochar Cóir Leighis maolaithe d'oibrithe forbartha deonacha (OFD) a thagann abhaile

source: Who is a volunteer development worker?
ga: Cé atá ina oibrí forbartha deonach ?

source: The Department of Social Protection classifies volunteer development workers as people working temporarily outside Ireland in a developing country on volunteer terms and where their work has been arranged by or through:
ga: Cuireann an Roinn Coimirce Sóisialaí síos ar oibrithe forbartha deonacha mar dhaoine atá ag obair go sealadach taobh amuigh d'Éirinn ar Théarmaí Deonacha i dtír atá ag forbairt agus sa chás go bhfuil a gcuid fostaíochta eagraithe ag nó tríd:

source: • A non-governmental agency in Ireland
ga: • Gníomhaireacht neamh-rialtais in Éirinn

source: • A governmental or non-governmental agency in any member of the European Union
ga: • Gníomhaireacht rialtais nó neamh-rialtais in aon Bhallstát den Aontas Eorpach

source: • Directly with the government of the developing country
ga: • Go díreach le Rialtas na tíre atá ag forbairt

source: Volunteer terms means that the salary or wage you receive for the work undertaken is consistent with local rates of pay in the developing country
ga: Ciallaíonn Téarmaí Deonacha go bhfuil an íocaíocht (tuarastal/pá) a fhaigheann tú don obair a dhéanann tú ag dul le rátaí áitiúla pá sa tír atá ag forbairt)

source: Members of religious orders whose work involves pastoral duties are not considered to be volunteer development workers for the purpose of this scheme
ga: Ní bhreathnaítear ar bhaill na nord rialta a bhfuil dualgais tréadacha orthu mar oibrithe forbartha deonacha ar mhaithe leis an scéim seo

source: In order to qualify for VDW credits, you must be a volunteer development worker as defined above
ga: Ar mhaithe le bheith i dteideal na gCreidiúintí OFD ní mór duit a bheith i d'oibrí forbartha deonach mar atá leagtha síos thuas

source: You must also satisfy the following conditions:
ga: Ní mór duit freisin na coinníollacha seo a leanas a shásamh:

source: • You must be over 16 years of age
ga: • Ní mór duit a bheith ós cionn 16 bliana déag d'aois

source: • You must have been resident in Ireland immediately prior to taking up the employment
ga: • Ní mór go raibh cónaí in Éirinn ort díreach roimh duit an fhostaíocht a thógáil

source: • You must be employed under conditions of remuneration (pay in return for work) similar to the local conditions applying in the developing country
ga: • Ní mór duit a bheith fostaithe faoi choinníollacha íocaíochta (pá don obair a dhéanann tú) atá cosúil leis na coinníollacha áitiúla a bhaineann leis an tír atá ag forbairt

source: • You must have paid a minimum of 104 weeks social insurance contributions (PRSI) at Class A since starting work
ga: • Ní mór go mbeadh ar a laghad 104 seachtainí ranníocaíochta árachais shóisialaigh (ÁSPC) ag Aicme A íochta agat ó thosaigh tú ag obair

source: If you have less than 104 Class A contributions paid Comhlámh will pay Class A contributions for you to bring your total up to the required 104
ga: Má tá níos lú ná 104 ranníocaíocht ag Aicme A agat, is féidir le Comhlámh ansin ranníocaíochtaí ag Aicme A a íoc ar do shon le go mbeidh an 104 ranníocaíocht atá riachtanach agat

source: Where there are 2 consecutive tax years in which no contribution has been paid or credited immediately prior to you going abroad as a volunteer development worker, Comhlámh will pay Class A contributions for the first 26 weeks of your assignment
ga: Sa chás go bhfuil 2 bhliain chánach as a chéile nár íocadh aon ranníocaíochtaí iontu nó nár déanadh aon ranníocaíochtaí a chreidiúint díreach roimh duit dul thar lear mar oibrí forbartha deonach, íocadh Comhlámh ranníocaíochtaí Aicme A ar son an chéad 26 seachtain de do chuid oibre

source: VDW credits can only be awarded for a maximum of 5 years
ga: Ní féidir Creidiúintí OFD a bhronnadh ach ar feadh tréimhse 5 bliana ar a mhéid

source: Different periods of work as a volunteer development worker (VDW) are aggregated for the purpose of calculating the 5 years
ga: Cuirtear tréimhsí éagsúla oibre mar oibrí forbartha deonach (OFD) le chéile ar mhaithe leis an gcúig bliana sin a ríomh

source: For example, if you were a VDW for 3 years previously, and wish to go abroad as a VDW for another 3 years, you will only qualify for VDW credits for 2 years of your second assignment
ga: Mar shampla, má bhí tú i d'OFD ar feadh 3 bliana cheana, agus más mian leat dul thar lear arís mar OFD ar feadh 3 bliana eile, ní beidh tú in ann Creidiúintí OFD a fháil ach ar feadh 2 bhliain den dara tréimhse

source: Where the period of your assignment abroad exceeds 5 years, you will, where possible, be awarded VDW credits for the period that is most beneficial to you
ga: Sa chás go maireann an tréimhse oibre thar lear ar feadh níos mó ná 5 bliana, bronnfar ort, más féidir, creidiúintí OFD don tréimhse is fearr a dhéanfaidh leas duit

source: Career breaks and social insurance contributions
ga: Sosanna gairme agus ranníocaíochtaí árachais shóisialaigh

source: Volunteer development workers who avail of career breaks from their normal employment in order to work abroad should contact their local social welfare office or Intreo centre if they are not re-employed immediately after their assignment ceases
ga: Ba cheart d'OFD a thógann sosanna gairme óna bhfostaíocht ar mhaithe le dul thar lear ag obair dul i dteagmháil leis an oifig áitiúil leasa shóisialaigh nó ionad Intreo muna mbíonn siad athfhostaithe díreach tar éis don tréimhse oibre thar lear críochnú

source: The general rule is that returned volunteer development workers are entitled to claim Jobseeker's Benefit if the period of their career break has expired and there is no work available from their previous employer
ga: Mar riail ghinearálta is féidir le hoibrithe deonacha forbartha Sochar Cuardaitheora Poist a éileamh má tá deireadh tagtha le tréimhse na sosa gairme agus muna bhfuil aon obair ar fáil dóibh ón bhfostóir a bhíodh acu

source: However, if the period of the career break has not expired, you will not be entitled to claim
ga: Ach, muna bhfuil tréimhse na sosa gairme caite ní bheidh tú i dteideal éilimh a dhéanamh

source: You can apply for credited contributions by completing Form VOL DEV 1 (pdf)
ga: Is féidir iarratas a dhéanamh ar ranníocaíochtaí creidiúnaithe má líonann tú foirm VOL DEV 1 (pdf)

source: Completed forms should be returned to your sending agency, which will in turn forward it to Comhlámh
ga: Ba cheart foirmeacha comhlánaithe a chur ar ais chuig d'eagraíocht seolta a chuirfidh ar aghaidh ansin é chuig Comhlámh

source: Ensure that you quote your correct Personal Public Service Number (PPS Number) when you complete the form
ga: Déan cinnte d'uimhir cheart a thabhairt Uimhir Phearsanta Seirbhíse Poiblí (PSP) nuair atá foirm VOL DEV 1 dhá chomhlánú agat

source: Comhlámh then validates the credentials of the sending agency and verifies that you are working overseas on volunteer terms
ga: Déanann Comhlámh ansin dintiúirí na heagraíochta seolta a dhaingniú agus deimhníonn sé go bhfuil tú ag obair thar lear ar Théarmaí Deonacha

source: Following validation, Comhlámh contacts the Special Collection Section of the Department of Social Protection and the period of your assignment is noted by this office
ga: Tar éis an deimhnithe, déanann Comhlámh teagmháil leis an Rannóg Bhailiúcháin Speisialta den Roinn Coimirce Sóisialaí agus déanann an oifig seo nóta den tréimhse ama atá le caitheamh thar lear agat

source: You can find more information about the Volunteer Development Worker scheme on the Department of Social Protection website
ga: Is féidir leat tuilleamh a léamh maidir leis an scéim um Oibrí Forbartha Deonach anseo
